app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)

		if @post.save
---
INSERT INTO "posts" ("title", "submitted_by", "post", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dafd"], ["submitted_by", "fdafd"], ["post", "fdadfads"], ["created_at", 2017-03-12 03:35:36 UTC], ["updated_at", 2017-03-12 03:35:36 UTC]]